swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_hkdf.c
/**************************************************************************//**
 * @file     rtl8735b_hkdf.c
 * @brief    Implement "key derivation function" hkdf code functions.
 *
 * @version  V1.00
 * @date     2021-07-21
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

// TODO add doxygen
/**
  \brief todo
*/
#include "cmsis.h"
#include "memory.h"

#if CONFIG_HKDF_EN

#include "basic_types.h"
#include "rtl8735b.h"
#include "rtl8735b_hkdf.h"

#define SECTION_HKDF_TEXT           SECTION(".rom.hal_hkdf.text")
#define SECTION_HKDF_DATA           SECTION(".rom.hal_hkdf.data")
#define SECTION_HKDF_RODATA         SECTION(".rom.hal_hkdf.rodata")
#define SECTION_HKDF_BSS            SECTION(".rom.hal_hkdf.bss")
#define SECTION_HKDF_STUBS          SECTION(".rom.hal_hkdf.stubs")
#define SECTION_HKDF_EXT_STUBS      SECTION(".rom.hal_hkdf_extend.stubs")


// TODO doxygen
#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_HKDF_STUBS
const hal_hkdf_func_stubs_t hal_hkdf_stubs = {
	.hal_hkdf_derive = hal_rtl_hkdf_derive,
	.hal_hkdf_extract = hal_rtl_hkdf_extract,
	.hal_hkdf_expand = hal_rtl_hkdf_expand
};
#else

SECTION_HKDF_STUBS
const hal_hkdf_func_stubs_t hal_hkdf_stubs = {
	.hal_hkdf_init = hal_rtl_hkdf_init,
	.hal_hkdf_deinit = hal_rtl_hkdf_deinit,
	.hal_hkdf_hook_operate_f = hal_rtl_hkdf_hook_operate_f,
#if 0
	.hal_hkdf_derive = hal_rtl_hkdf_derive,
#endif
	.hal_hkdf_extract = hal_rtl_hkdf_extract,
	.hal_hkdf_extract_engine = hal_rtl_hkdf_extract_engine,
	.hal_hkdf_expand = hal_rtl_hkdf_expand,
	.hal_hkdf_expand_engine = hal_rtl_hkdf_expand_engine,
	.hal_hkdf_secure_set_cfg = hal_rtl_hkdf_secure_set_cfg,
	.hal_hkdf_extract_secure_set_cfg = hal_rtl_hkdf_extract_secure_set_cfg,
	.hal_hkdf_expand_secure_set_cfg = hal_rtl_hkdf_expand_secure_set_cfg,
	.hal_hkdf_extract_secure = hal_rtl_hkdf_extract_secure,
	.hal_hkdf_expand_secure = hal_rtl_hkdf_expand_secure,
	.hal_hkdf_expand_register_info_extend = hal_rtl_hkdf_expand_register_info_extend,
	.hal_hkdf_expand_unregister_info_extend = hal_rtl_hkdf_expand_unregister_info_extend,
};

SECTION_HKDF_EXT_STUBS
const hal_hkdf_extend_func_stubs_t hal_hkdf_ext_stubs = {
	.hal_hkdf_hmac_init_hook = hal_rtl_hkdf_hmac_init_hook,
	.hal_hkdf_hmac_update_hook = hal_rtl_hkdf_hmac_update_hook,
	.hal_hkdf_hmac_final_hook = hal_rtl_hkdf_hmac_final_hook,
	.hal_hkdf_extract_secure_all = hal_rtl_hkdf_extract_secure_all,
	.hal_hkdf_expand_secure_all = hal_rtl_hkdf_expand_secure_all,
};
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
// For Test-chip

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_extract(hal_hkdf_adapter_t *adtr)
{
	u8 null_salt[64];
	int ret;

	if (NULL == adtr->salt) {
		// FIXME if not provided, it is set to a string of HashLen zeros
		u8 *local_salt = (uint8_t *)(((((uint32_t)null_salt - 1) >> 5) + 1) << 5);   // make salt always is a 32-byte aligned address
		size_t local_salt_len = 32;
		_memset((void *)local_salt, 0, local_salt_len);
		ret = adtr->hmac_func_init(local_salt, local_salt_len);
	} else {
		ret = adtr->hmac_func_init(adtr->salt, adtr->salt_len);
	}
	// salt = key, salt_len = key_len
	//ret = crypto_hmac_sha2_256_init (salt, salt_len);
	if (ret != SUCCESS) {
		goto __hkdf_extract_exit;
	}

	//ret = crypto_hmac_sha2_256_update (ikm, ikm_len);
	ret = adtr->hmac_func_update(adtr->ikm, adtr->ikm_len);
	if (ret != SUCCESS) {
		goto __hkdf_extract_exit;
	}

	//ret = crypto_hmac_sha2_256_final (prk);
	ret = adtr->hmac_func_final(adtr->prk);

__hkdf_extract_exit:
	return (ret);
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand(hal_hkdf_adapter_t *adtr)
{
	const size_t hash_len = 32;
	size_t where = 0;
	size_t n;
	size_t t_len = 0;
	size_t i;
	int32_t ret = 0;
	uint8_t t_buf[64];
	uint8_t *t;
	const size_t t_buf_len = 32;

	t = (uint8_t *)(((((uint32_t)t_buf - 1) >> 5) + 1) << 5);   // make t always is a 32-byte aligned address

	if (adtr->nonce == NULL) {
		adtr->nonce = (const unsigned char *) "";
		adtr->nonce_len = 0;
	}

	n = adtr->okm_len / hash_len;

	if ((adtr->okm_len % hash_len) != 0) {
		n++;
	}

	/*
	 * Per RFC 5869 Section 2.3, okm_len must not exceed
	 * 255 times the hash length
	 */
	if (n > 255) {
		ret =  -HAL_ERR_PARA;
		goto __hkdf_expand_exit;
	}

	/*
	 * Compute T = T(1) | T(2) | T(3) | ... | T(N)
	 * Where T(N) is defined in RFC 5869 Section 2.3
	 */
	for (i = 1; i <= n; i++) {
		size_t num_to_copy;
		unsigned char c = i & 0xff;

		//ret = crypto_hmac_sha2_256_init (prk, prk_len);
		ret = adtr->hmac_func_init(adtr->prk, adtr->prk_len);
		if (ret != SUCCESS) {
			goto __hkdf_expand_exit;
		}

		if (t_len > 0) {
			//ret = crypto_hmac_sha2_256_update (t, t_len);
			ret = adtr->hmac_func_update(t, t_len);
			if (ret != SUCCESS) {
				goto __hkdf_expand_exit;
			}
		}

		if ((adtr->nonce_len > 0) && (adtr->nonce != NULL)) {
			//ret = crypto_hmac_sha2_256_update (info, info_len);
			ret = adtr->hmac_func_update(adtr->nonce, adtr->nonce_len);
			if (ret != SUCCESS) {
				goto __hkdf_expand_exit;
			}
		}

		/* The constant concatenated to the end of each T(n) is a single octet.
		 * */
		//ret = crypto_hmac_sha2_256_update (&c, 1);
		ret = adtr->hmac_func_update(&c, 1);
		if (ret != SUCCESS) {
			goto __hkdf_expand_exit;
		}

		//ret = crypto_hmac_sha2_256_final (t);
		ret = adtr->hmac_func_final(t);
		if (ret != SUCCESS) {
			goto __hkdf_expand_exit;
		}

		num_to_copy = i != n ? hash_len : adtr->okm_len - where;
		_memcpy(adtr->okm + where, t, num_to_copy);
		where += hash_len;
		t_len = hash_len;
	}

__hkdf_expand_exit:
	_memset(t, 0, t_buf_len);

	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_derive(hal_hkdf_adapter_t *adtr)
{
	// TODO check input invalid
	int ret;
	uint8_t prk_buf[64];
	uint8_t *prk;
	const size_t prk_len = 32;

	// make prk always is a 32-byte aligned address
	prk = (uint8_t *)(((((uint32_t)prk_buf - 1) >> 5) + 1) << 5);
	// FIXME how many of prk_buf will be used


	// TODO Arg check
	if (NULL == adtr->hmac_func_init) {
		return HAL_ERR_PARA;
	} else if (NULL == adtr->hmac_func_update) {
		return HAL_ERR_PARA;
	} else if (NULL == adtr->hmac_func_final) {
		return HAL_ERR_PARA;
	}
	adtr->prk = prk;
	adtr->prk_len = 32;
	ret = hal_rtl_hkdf_extract(adtr);

	if (ret == SUCCESS) {
		ret = hal_rtl_hkdf_expand(adtr);
	}

