swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_hkdf.c
	_memset(prk, 0, prk_len);

	return ret;
}
SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_hmac_sha256_secure_init(hal_hkdf_adapter_t *phkdf_adtr, hal_crypto_adapter_t *pcrypto_adapter, const u8 crypto_sel)
{
	hal_status_t ret = HAL_NOT_READY;
	DBG_CRYPTO_ERR("Test-chip non-support\r\n");
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_extract_secure_all(hal_hkdf_adapter_t *phkdf_adtr, const u8 sk_idx, const u8 wb_idx, const u8 *msg_buf)
{
	hal_status_t ret = HAL_NOT_READY;
	DBG_CRYPTO_ERR("Test-chip non-support\r\n");
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand_secure_all(hal_hkdf_adapter_t *phkdf_adtr, const u8 sk_idx, const u8 wb_idx, const u8 *msg_buf)
{
	hal_status_t ret = HAL_NOT_READY;
	DBG_CRYPTO_ERR("Test-chip non-support\r\n");
	return ret;
}

#else

// After A-cut

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_hmac_sha256_secure_init(hal_hkdf_adapter_t *phkdf_adtr, hal_crypto_adapter_t *pcrypto_adapter, const u8 crypto_sel)
{
	hal_status_t  ret = HAL_OK;
	ret = hal_rtl_hkdf_hmac_init(phkdf_adtr, pcrypto_adapter, crypto_sel, HKDF_HMAC_SHA256);
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_hmac_init(hal_hkdf_adapter_t *phkdf_adtr, hal_crypto_adapter_t *pcrypto_adapter,
									const u8 crypto_sel, const u8 hmac_alg_sel)
{
	hal_status_t  ret = HAL_OK;
	u32 crypto_cfg;
	crypto_cfg = hkdf_set_crypto_cfg(crypto_sel, hmac_alg_sel);
	ret = hal_rtl_hkdf_init(phkdf_adtr, pcrypto_adapter, crypto_cfg, HKDF_ORI_SEL_DIS);
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_init(hal_hkdf_adapter_t *phkdf_adtr, hal_crypto_adapter_t *pcrypto_adapter, const u32 crypto_cfg, const u8 ori_en)
{
	hal_status_t  ret = HAL_OK;
	int32_t cryp_ret;
	u16 crypto_sel = 0, hmac_alg_sel = 0;
	if (NULL == phkdf_adtr) {
		return HAL_ERR_PARA;
	}

	_memset(phkdf_adtr, 0x0, sizeof(hal_hkdf_adapter_t));
	hmac_alg_sel = hkdf_get_low_2byte(crypto_cfg);
	crypto_sel = hkdf_get_high_2byte(crypto_cfg);

	if (HKDF_CRYPTO_HW_SEL_EN == crypto_sel) {
		// init ceypto engine
		if (NULL == pcrypto_adapter) {
			return HAL_ERR_PARA;
		} else {
			if (_TRUE != pcrypto_adapter->isInit) {
				DBG_CRYPTO_ERR("hkdf: HW Crypto not init yet!\r\n");
				return HAL_NOT_READY;
			} else {
				phkdf_adtr->pcrypto_adtr = pcrypto_adapter;
				phkdf_adtr->isHWCrypto_Init = _TRUE;
			}
		}
	}

	phkdf_adtr->crypto_sel = crypto_sel;
	switch (hmac_alg_sel) {
	case HKDF_HMAC_SHA256:
		phkdf_adtr->digest_len = HKDF_SHA2_256_HASH_SIZE;
		phkdf_adtr->extract_key_len = HKDF_SHA256_KEY_LENGTH;
		phkdf_adtr->expand_key_len = HKDF_SHA256_KEY_LENGTH;
		phkdf_adtr->seq_hkdf_buf_len = HKDF_SHA2_256_HASH_SIZE;
		break;
	case HKDF_HMAC_SHA384:
		break;
	case HKDF_HMAC_SHA512:
		break;
	default:
		hmac_alg_sel = HKDF_HMAC_SHA256;
		phkdf_adtr->digest_len = HKDF_SHA2_256_HASH_SIZE;
		phkdf_adtr->extract_key_len = HKDF_SHA256_KEY_LENGTH;
		phkdf_adtr->expand_key_len = HKDF_SHA256_KEY_LENGTH;
		phkdf_adtr->seq_hkdf_buf_len = HKDF_SHA2_256_HASH_SIZE;
		break;
	}
	phkdf_adtr->hmac_alg_sel = hmac_alg_sel;
	phkdf_adtr->ori_en = ori_en;
	phkdf_adtr->isInit = _TRUE;
	ret = hal_rtl_hkdf_hook_operate_f(phkdf_adtr, NULL, NULL, NULL);
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_deinit(hal_hkdf_adapter_t *phkdf_adtr)
{
	hal_status_t  ret = HAL_OK;
	if (NULL == phkdf_adtr) {
		return HAL_ERR_PARA;
	}
	phkdf_adtr->isInit = _FALSE;
	phkdf_adtr->isHWCrypto_Init = _FALSE;
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_hook_operate_f(hal_hkdf_adapter_t *phkdf_adtr, hkdf_hmac_init_func_t hmac_init_f,
		hkdf_hmac_update_func_t hmac_update_f, hkdf_hmac_final_func_t hmac_final_f)
{
	hal_status_t  ret = HAL_OK;
	if (NULL == phkdf_adtr) {
		return HAL_ERR_PARA;
	}

	if (phkdf_adtr->isInit != _TRUE) {
		return HAL_NOT_READY; // not init yet
	}

	hal_rtl_hkdf_hmac_init_hook(phkdf_adtr, hmac_init_f);
	hal_rtl_hkdf_hmac_update_hook(phkdf_adtr, hmac_update_f);
	hal_rtl_hkdf_hmac_final_hook(phkdf_adtr, hmac_final_f);
	return ret;
}

SECTION_HKDF_TEXT
static int hal_rtl_hkdf_hmac_sha2_256_init(void *arg, const u8 *key, const u32 keylen)
{
	hal_hkdf_adapter_t *phkdf_adtr = (hal_hkdf_adapter_t *)arg;
	int ret;
	if (NULL == phkdf_adtr) {
		return HAL_ERR_PARA;
	}
	if (HKDF_CRYPTO_HW_SEL_EN == phkdf_adtr->crypto_sel) {
		if (NULL == phkdf_adtr->pcrypto_adtr) {
			return HAL_ERR_PARA;
		}
		if (HKDF_KEY_STG_SKCFG_NONE == phkdf_adtr->sk_cfg) {
			ret = hal_rtl_crypto_auth_init(phkdf_adtr->pcrypto_adtr, AUTH_TYPE_HMAC_SHA2_256_ALL, key, keylen);
		} else {
			ret = hal_rtl_crypto_auth_sk_init(phkdf_adtr->pcrypto_adtr, AUTH_TYPE_HMAC_SHA2_256_ALL, key, (phkdf_adtr->sk_cfg));
		}
	}
	return ret;
}

SECTION_HKDF_TEXT
static int hal_rtl_hkdf_hmac_sha2_256_update(void *arg, const u8 *message, const u32 msglen)
{
	hal_hkdf_adapter_t *phkdf_adtr = (hal_hkdf_adapter_t *)arg;
	int ret;
	if (NULL == phkdf_adtr) {
		return HAL_ERR_PARA;
	}
	if (HKDF_CRYPTO_HW_SEL_EN == phkdf_adtr->crypto_sel) {
		if (NULL == phkdf_adtr->pcrypto_adtr) {
			return HAL_ERR_PARA;
		}
		ret = hal_rtl_crypto_auth_update(phkdf_adtr->pcrypto_adtr, AUTH_TYPE_HMAC_SHA2_256_ALL, message, msglen);
	}
	return ret;
}

SECTION_HKDF_TEXT
static int hal_rtl_hkdf_hmac_sha2_256_final(void *arg, u8 *pDigest)
{
	hal_hkdf_adapter_t *phkdf_adtr = (hal_hkdf_adapter_t *)arg;
	int ret;
	if (NULL == phkdf_adtr) {
		return HAL_ERR_PARA;
	}
	if (HKDF_CRYPTO_HW_SEL_EN == phkdf_adtr->crypto_sel) {
		if (NULL == phkdf_adtr->pcrypto_adtr) {
			return HAL_ERR_PARA;
		}
		if (HKDF_KEY_STG_SKCFG_NONE == phkdf_adtr->sk_cfg) {
			ret = hal_rtl_crypto_auth_final(phkdf_adtr->pcrypto_adtr, AUTH_TYPE_HMAC_SHA2_256_ALL, pDigest);
		} else {
			ret = hal_rtl_crypto_auth_sk_final(phkdf_adtr->pcrypto_adtr, AUTH_TYPE_HMAC_SHA2_256_ALL, pDigest);
		}
	}
	return ret;
}

SECTION_HKDF_TEXT
void hal_rtl_hkdf_hmac_init_hook(hal_hkdf_adapter_t *phkdf_adtr, hkdf_hmac_init_func_t hmac_init_f)
{
	u16 hmac_alg_sel = 0;
	if (NULL != hmac_init_f) {
		phkdf_adtr->hmac_init_f = hmac_init_f;
	} else {
		hmac_alg_sel = (phkdf_adtr->hmac_alg_sel);
		switch (hmac_alg_sel) {
		case HKDF_HMAC_SHA256:
			phkdf_adtr->hmac_init_f = hal_rtl_hkdf_hmac_sha2_256_init;
			break;
		case HKDF_HMAC_SHA384:
			break;
		case HKDF_HMAC_SHA512:
			break;
		default:
			phkdf_adtr->hmac_init_f = hal_rtl_hkdf_hmac_sha2_256_init;
			break;
		}
	}
}

SECTION_HKDF_TEXT
void hal_rtl_hkdf_hmac_update_hook(hal_hkdf_adapter_t *phkdf_adtr, hkdf_hmac_update_func_t hmac_update_f)
{
	u16 hmac_alg_sel = 0;
	if (NULL != hmac_update_f) {
		phkdf_adtr->hmac_update_f = hmac_update_f;
	} else {
		hmac_alg_sel = (phkdf_adtr->hmac_alg_sel);
		switch (hmac_alg_sel) {
		case HKDF_HMAC_SHA256:
			phkdf_adtr->hmac_update_f = hal_rtl_hkdf_hmac_sha2_256_update;
			break;
		case HKDF_HMAC_SHA384:
			break;
		case HKDF_HMAC_SHA512:
			break;
		default:
			phkdf_adtr->hmac_update_f = hal_rtl_hkdf_hmac_sha2_256_update;
			break;
		}
	}
}

SECTION_HKDF_TEXT
void hal_rtl_hkdf_hmac_final_hook(hal_hkdf_adapter_t *phkdf_adtr, hkdf_hmac_final_func_t hmac_final_f)
{
	u16 hmac_alg_sel = 0;
	if (NULL != hmac_final_f) {
		phkdf_adtr->hmac_final_f = hmac_final_f;
	} else {
		hmac_alg_sel = (phkdf_adtr->hmac_alg_sel);
		switch (hmac_alg_sel) {
		case HKDF_HMAC_SHA256:
			phkdf_adtr->hmac_final_f = hal_rtl_hkdf_hmac_sha2_256_final;
			break;
		case HKDF_HMAC_SHA384:
			break;
		case HKDF_HMAC_SHA512:
			break;
		default:
			phkdf_adtr->hmac_final_f = hal_rtl_hkdf_hmac_sha2_256_final;
			break;
		}
	}
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_secure_set_cfg(hal_hkdf_adapter_t *phkdf_adtr, const u8 sk_sel, const u8 sk_idx,
		const u8 wb_sel, const u8 wb_idx)
{
	hal_status_t ret = HAL_OK;
	hal_crypto_key_cfg_t key_cfg;
	hal_crypto_wb_cfg_t wb_cfg;

	if (phkdf_adtr->isInit != _TRUE) {
		return HAL_NOT_READY; // not init yet
	}

	phkdf_adtr->sk_cfg = 0x0;

	key_cfg.b.idx = sk_idx;
	key_cfg.b.sel = sk_sel;
	hal_rtl_crypto_set_sk_cfg_info(&(phkdf_adtr->sk_cfg), (key_cfg.w), CRYPTO_KEY_STG_ROLE_KEYCFG);
	DBG_CRYPTO_INFO("set key_cfg = 0x%x\r\n", key_cfg);

	wb_cfg.b.idx = wb_idx;
	wb_cfg.b.sel = wb_sel;
	hal_rtl_crypto_set_sk_cfg_info(&(phkdf_adtr->sk_cfg), (wb_cfg.w), CRYPTO_KEY_STG_ROLE_WBCFG);
	DBG_CRYPTO_INFO("set wb_cfg = 0x%x\r\n", wb_cfg);
	DBG_CRYPTO_INFO("set sk_cfg = 0x%x\r\n", phkdf_adtr->sk_cfg);

