swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_hkdf.c
	return (ret);
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_extract_secure_set_cfg(hal_hkdf_adapter_t *phkdf_adtr, const u8 sk_sel, const u8 sk_idx,
		const u8 wb_sel, const u8 wb_idx)
{
	hal_status_t ret = HAL_OK;
	if (phkdf_adtr->isInit != _TRUE) {
		return HAL_NOT_READY; // not init yet
	}

	ret = hal_rtl_hkdf_secure_set_cfg(phkdf_adtr, sk_sel, sk_idx, wb_sel, wb_idx);
	if (HAL_OK == ret) {
		phkdf_adtr->key_extract_sk_sel = sk_sel;
		phkdf_adtr->extract_sk_idx = sk_idx;
		phkdf_adtr->key_extract_stg_wb_sel = wb_sel;
		phkdf_adtr->extract_wb_idx = wb_idx;
	}
	phkdf_adtr->use_key_stg = HKDF_USE_KEY_STG_EN;
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand_secure_set_cfg(hal_hkdf_adapter_t *phkdf_adtr, const u8 sk_sel, const u8 sk_idx,
		const u8 wb_sel, const u8 wb_idx)
{
	hal_status_t ret = HAL_OK;
	if (phkdf_adtr->isInit != _TRUE) {
		return HAL_NOT_READY; // not init yet
	}

	ret = hal_rtl_hkdf_secure_set_cfg(phkdf_adtr, sk_sel, sk_idx, wb_sel, wb_idx);
	if (HAL_OK == ret) {
		phkdf_adtr->key_expand_sk_sel = sk_sel;
		phkdf_adtr->expand_sk_idx = sk_idx;
		phkdf_adtr->key_expand_stg_wb_sel = wb_sel;
		phkdf_adtr->expand_wb_idx = wb_idx;
	}
	phkdf_adtr->use_key_stg = HKDF_USE_KEY_STG_EN;
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_extract_engine(hal_hkdf_adapter_t *phkdf_adtr, const u8 *key_buf, const u8 *msg_buf, const u32 msg_len,
		u8 *pkm_buf)
{
	int crypto_ret;
	hal_status_t ret = HAL_OK;
	u32 key_len = 0;
	u32 info_len = 0;
	u8 *p_key = NULL;
	u8 *p_info = NULL;
	u8 *p_prk = NULL;

	p_key = key_buf;
	key_len = (phkdf_adtr->extract_key_len);
	info_len = msg_len;
	p_info = msg_buf;
	p_prk = pkm_buf;

	if (key_buf != NULL) {
		if ((u32)(key_buf) & 0x1F) {
			_memcpy(&(phkdf_adtr->ikm_buf[0]), key_buf, key_len);
			p_key = &(phkdf_adtr->ikm_buf[0]);
		} else {
			p_key = key_buf;
		}
	}

	crypto_ret = phkdf_adtr->hmac_init_f(phkdf_adtr, p_key, key_len);
	if (crypto_ret != SUCCESS) {
		ret = HAL_ERR_PARA;
		goto __hal_rtl_hkdf_extract_engine_exit;
	}

	crypto_ret = phkdf_adtr->hmac_update_f(phkdf_adtr, p_info, info_len);
	if (crypto_ret != SUCCESS) {
		ret = HAL_ERR_PARA;
		goto __hal_rtl_hkdf_extract_engine_exit;
	}

	crypto_ret = phkdf_adtr->hmac_final_f(phkdf_adtr, p_prk);
	if (crypto_ret != SUCCESS) {
		ret = HAL_ERR_PARA;
		goto __hal_rtl_hkdf_extract_engine_exit;
	}

__hal_rtl_hkdf_extract_engine_exit:
	return (ret);
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand_engine(hal_hkdf_adapter_t *phkdf_adtr, const u8 *key_buf, const u8 *msg_buf, const u32 msg_len,
										u8 *okm_buf)
{
	hal_status_t ret = HAL_OK;
	int crypto_ret = 0;
	u32 info_len = 0;
	u32 where = 0;
	u32 okm_len = 0;
	u32 n = 0;
	u32 i = 0;
	u32 t_len = 0;
	u32 hash_len = 32;
	u32 t_seq_len = 0;
	u32 prk_len = 0;
	u8 *p_tmp_seq = NULL;
	u8 *p_prk = NULL;
	u8 *p_info = NULL;
	u8 *p_okm = NULL;

	p_prk = key_buf;
	prk_len = (phkdf_adtr->expand_key_len);
	p_info = msg_buf;
	info_len = msg_len;
	p_okm = okm_buf;
	okm_len = (phkdf_adtr->okm_len);
	hash_len = (phkdf_adtr->digest_len);

	if (key_buf != NULL) {
		if ((u32)(key_buf) & 0x1F) {
			_memcpy(&(phkdf_adtr->prk_buf[0]), key_buf, prk_len);
			p_prk = &(phkdf_adtr->prk_buf[0]);
		} else {
			p_prk = key_buf;
		}
	}

	if (KEY_STG_WBTYPE_WB_ONLY_STG != phkdf_adtr->key_expand_stg_wb_sel) {
		p_tmp_seq = &(phkdf_adtr->seq_hkdf_buf[0]);
		t_seq_len = (phkdf_adtr->seq_hkdf_buf_len);
		if (p_okm == NULL) {
			ret = HAL_ERR_PARA;
			goto __hal_rtl_hkdf_expand_engine_exit;
		}
	}

	if (p_info == NULL) {
		p_info = (const unsigned char *) "";
		info_len = 0;
	}

	n = okm_len / hash_len;

	if ((okm_len % hash_len) != 0) {
		n++;
	}

	/*
	 * Per RFC 5869 Section 2.3, okm_len must not exceed
	 * 255 times the hash length
	 */
	if (n > 255) {
		ret =  HAL_ERR_PARA;
		goto __hal_rtl_hkdf_expand_engine_exit;
	}

	/*
	 * Compute T = T(1) | T(2) | T(3) | ... | T(N)
	 * Where T(N) is defined in RFC 5869 Section 2.3
	 */
	for (i = 1; i <= n; i++) {
		size_t num_to_copy;
		unsigned char c = i & 0xff;

		crypto_ret = phkdf_adtr->hmac_init_f(phkdf_adtr, p_prk, prk_len);
		if (crypto_ret != SUCCESS) {
			ret = HAL_ERR_PARA;
			goto __hal_rtl_hkdf_expand_engine_exit;
		}

		if (t_len > 0) {
			crypto_ret = phkdf_adtr->hmac_update_f(phkdf_adtr, p_tmp_seq, t_len);
			if (crypto_ret != SUCCESS) {
				ret = HAL_ERR_PARA;
				goto __hal_rtl_hkdf_expand_engine_exit;
			}
		}

		if ((info_len > 0) && (p_info != NULL)) {
			crypto_ret = phkdf_adtr->hmac_update_f(phkdf_adtr, p_info, info_len);
			if (crypto_ret != SUCCESS) {
				ret = HAL_ERR_PARA;
				goto __hal_rtl_hkdf_expand_engine_exit;
			}
		}

		/*  if info extend(info2/3) register, then hkdf include those info
		 *  For example: use this for device life cycle changed
		 */
		if ((phkdf_adtr->info2_len > 0) && (phkdf_adtr->info2 != NULL)) {
			crypto_ret = phkdf_adtr->hmac_update_f(phkdf_adtr, (phkdf_adtr->info2), (phkdf_adtr->info2_len));
			if (crypto_ret != SUCCESS) {
				ret = HAL_ERR_PARA;
				goto __hal_rtl_hkdf_expand_engine_exit;
			}
		}

		if ((phkdf_adtr->info3_len > 0) && (phkdf_adtr->info3 != NULL)) {
			crypto_ret = phkdf_adtr->hmac_update_f(phkdf_adtr, (phkdf_adtr->info3), (phkdf_adtr->info3_len));
			if (crypto_ret != SUCCESS) {
				ret = HAL_ERR_PARA;
				goto __hal_rtl_hkdf_expand_engine_exit;
			}
		}

		/* The constant concatenated to the end of each T(n) is a single octet.
		 * */
		crypto_ret = phkdf_adtr->hmac_update_f(phkdf_adtr, &c, 1);
		if (crypto_ret != SUCCESS) {
			ret = HAL_ERR_PARA;
			goto __hal_rtl_hkdf_expand_engine_exit;
		}

		crypto_ret = phkdf_adtr->hmac_final_f(phkdf_adtr, p_tmp_seq);
		if (crypto_ret != SUCCESS) {
			ret = HAL_ERR_PARA;
			goto __hal_rtl_hkdf_expand_engine_exit;
		}

		if (KEY_STG_WBTYPE_WB_ONLY_STG != phkdf_adtr->key_expand_stg_wb_sel) {
			num_to_copy = i != n ? hash_len : (okm_len - where);
			_memcpy(p_okm + where, p_tmp_seq, num_to_copy);
			where += hash_len;
			t_len = hash_len;
		}
	}

__hal_rtl_hkdf_expand_engine_exit:
	if (KEY_STG_WBTYPE_WB_ONLY_STG != phkdf_adtr->key_expand_stg_wb_sel) {
		_memset(p_tmp_seq, 0x0, t_seq_len);
	}

	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_extract_secure(hal_hkdf_adapter_t *phkdf_adtr, const u8 *key_buf, const u8 *msg_buf,
		const u32 msg_len, u8 *pkm_buf)
{
	hal_status_t ret = HAL_OK;
	u8 *p_key = NULL;
	u8 *p_km = NULL;

	if (phkdf_adtr->isInit != _TRUE) {
		return HAL_NOT_READY; // not init yet
	}
	if (KEY_STG_SKTYPE_LD_SK != phkdf_adtr->key_extract_sk_sel) {
		p_key = key_buf;
	}
	if (KEY_STG_WBTYPE_WB_ONLY_STG != phkdf_adtr->key_extract_stg_wb_sel) {
		p_km = pkm_buf;
	}
	ret = hal_rtl_hkdf_extract_engine(phkdf_adtr, p_key, msg_buf,  msg_len, p_km);

	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_extract_secure_all(hal_hkdf_adapter_t *phkdf_adtr, const u8 sk_idx, const u8 wb_idx, const u8 *msg_buf)
{
	hal_status_t  ret = HAL_OK;
	uint8_t *p_hshks = NULL;
	if (msg_buf == NULL) {
		return HAL_ERR_PARA;
	} else {
		p_hshks = msg_buf;
	}

