swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_hkdf.c
	ret = hal_rtl_hkdf_extract_secure_set_cfg(phkdf_adtr, KEY_STG_SKTYPE_LD_SK, sk_idx, KEY_STG_WBTYPE_WB_ONLY_STG, wb_idx);
	if (ret != HAL_OK) {
		return ret;
	}
	ret = hal_rtl_hkdf_extract_secure(phkdf_adtr, NULL, p_hshks, HKDF_SHA2_256_HASH_SIZE, NULL);
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_extract(hal_hkdf_adapter_t *phkdf_adtr, const u8 *salt, const u32 salt_len,
								  const u8 *ikm, const u32 ikm_len, u8 *prk)
{
	hal_status_t ret = HAL_OK;
	u8 *p_key = NULL;
	u8 *p_msg = NULL;
	u32 msg_len = 0;

	if (HKDF_ORI_SEL_EN == phkdf_adtr->ori_en) {
		if (NULL == salt) {
			return HAL_ERR_MEM;
		}
		if (salt_len != (phkdf_adtr->extract_key_len)) {
			return HAL_ERR_PARA;
		}
		p_key = (u8 *)salt;
		p_msg = (u8 *)ikm;
		msg_len = ikm_len;
	} else {
		if (NULL == ikm) {
			return HAL_ERR_MEM;
		}
		if (ikm_len != (phkdf_adtr->extract_key_len)) {
			return HAL_ERR_PARA;
		}
		p_key = (u8 *)ikm;
		p_msg = (u8 *)salt;
		msg_len = salt_len;
	}
	ret = hal_rtl_hkdf_extract_engine(phkdf_adtr, p_key, p_msg, msg_len, prk);
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand_register_info_extend(hal_hkdf_adapter_t *phkdf_adtr, const u8 *info, const u32 info_len, const u8 info_role)
{
	hal_status_t ret = HAL_OK;

	if (NULL == info) {
		return HAL_ERR_MEM;
	} else {
		if (0 == info_len) {
			return HAL_ERR_PARA;
		}
	}

	// register info 2/3
	switch (info_role) {
	case HKDF_EXPAND_INFO2:
		phkdf_adtr->info2 = info;
		phkdf_adtr->info2_len = info_len;
		break;
	case HKDF_EXPAND_INFO3:
		phkdf_adtr->info3 = info;
		phkdf_adtr->info3_len = info_len;
		break;
	default:
		break;
	}

	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand_unregister_info_extend(hal_hkdf_adapter_t *phkdf_adtr, const u8 info_role)
{
	hal_status_t ret = HAL_OK;

	// unregister info 2/3
	switch (info_role) {
	case HKDF_EXPAND_INFO2:
		phkdf_adtr->info2 = NULL;
		phkdf_adtr->info2_len = 0;
		break;
	case HKDF_EXPAND_INFO3:
		phkdf_adtr->info3 = NULL;
		phkdf_adtr->info3_len = 0;
		break;
	default:
		break;
	}

	return ret;
}


SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand_secure(hal_hkdf_adapter_t *phkdf_adtr, const u8 *prk, const u8 *nonce,
										const u32 nonce_len, u8 *okm, u32 okm_len)
{
	hal_status_t ret = HAL_OK;
	u8 *p_key = NULL;
	u8 *p_msg = NULL;
	u8 *p_okm = NULL;
	u32 msg_len = 0;

	if (phkdf_adtr->isInit != _TRUE) {
		return HAL_NOT_READY; // not init yet
	}
	if (okm_len != HKDF_SHA2_256_HASH_SIZE) {
		return HAL_ERR_PARA;
	} else {
		phkdf_adtr->okm_len = okm_len;
	}
	if (KEY_STG_SKTYPE_LD_SK != phkdf_adtr->key_expand_sk_sel) {
		p_key = prk;
	}
	if (KEY_STG_WBTYPE_WB_ONLY_STG != phkdf_adtr->key_expand_stg_wb_sel) {
		p_okm = okm;
	}

	p_msg = (u8 *)nonce;
	msg_len = nonce_len;
	ret = hal_rtl_hkdf_expand_engine(phkdf_adtr, p_key, p_msg, msg_len, p_okm);

	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand_secure_all(hal_hkdf_adapter_t *phkdf_adtr, const u8 sk_idx, const u8 wb_idx, const u8 *nonce)
{
	hal_status_t  ret = HAL_OK;
	uint8_t *p_hshkn = NULL;
	if (nonce == NULL) {
		return HAL_ERR_PARA;
	} else {
		p_hshkn = nonce;
	}

	ret = hal_rtl_hkdf_expand_secure_set_cfg(phkdf_adtr, KEY_STG_SKTYPE_LD_SK, sk_idx, KEY_STG_WBTYPE_WB_ONLY_STG, wb_idx);
	if (ret != HAL_OK) {
		return ret;
	}
	ret = hal_rtl_hkdf_expand_secure(phkdf_adtr, NULL, p_hshkn, HKDF_SHA2_256_HASH_SIZE, NULL, HKDF_SHA2_256_HASH_SIZE);
	return ret;
}

SECTION_HKDF_TEXT
hal_status_t hal_rtl_hkdf_expand(hal_hkdf_adapter_t *phkdf_adtr, const u8 *prk,
								 const u8 *nonce, const u32 nonce_len, u8 *okm, u32 okm_len)
{
	hal_status_t ret = HAL_OK;
	u8 *p_key = NULL;
	u8 *p_msg = NULL;
	u8 *p_okm = NULL;
	u32 msg_len = 0;

	p_key = (u8 *)prk;
	p_msg = (u8 *)nonce;
	msg_len = nonce_len;
	p_okm = (u8 *)okm;
	phkdf_adtr->okm_len = okm_len;

	ret = hal_rtl_hkdf_expand_engine(phkdf_adtr, p_key, p_msg, msg_len, p_okm);
	return ret;
}
#endif

#endif // end of "#if CONFIG_ROM_HKDF_EN"
